#+TITLE: September 24, 2018 - October 9, 2018 (16 days)
#+AUTHOR: dgplug.org
#+EMAIL: users@lists.dgplug.org
#+PROPERTY: Effort_ALL 0 0:05 0:10 0:30 1:00 2:00 3:00 4:00
#+COLUMNS: %35ITEM %TASKID %OWNER %3PRIORITY %TODO %5ESTIMATED{+} %3ACTUAL{+}
* REPORTS
** SCRUM BOARD
#+BEGIN: block-update-board
| TODO | NEXT | IN_PROGRESS | WAITING | DONE                                                         | CANCELED |
|------+------+-------------+---------+--------------------------------------------------------------+----------|
|      |      |             |         | . [#A] Computer Network by Kruose & R (2018-10-12)           |          |
|      |      |             |         | . Python Tutorials - Part I (2018-10-12)                     |          |
|      |      |             |         | READ.1537984768. Learning Golang Chapter 6. Met (2018-10-11) |          |
|      |      |             |         | . [#B] [[https://tutorial.djangogirls (2018-10-09)           |          |
|      |      |             |         | DEV.1537984318. Learning Golang Chapter 5 Exer (2018-10-04)  |          |
|      |      |             |         | READ.1537984603. Learning Golang Chapter 5. Fun (2018-10-03) |          |
#+END:
** DEVELOPER SUMMARY
#+BEGIN: block-update-summary
| NAME          | ESTIMATED |             ACTUAL | DONE | REMAINING | PENCILS DOWN | PROGRESS   |
|---------------+-----------+--------------------+------+-----------+--------------+------------|
| Homuncculus   |      34.0 | 14.240000000000002 | 34.0 |         0 |   2018-10-12 | ########## |
| Bhavin192     |      7.32 |               7.16 | 7.32 |         0 |   2018-10-12 | ########## |
| Jasonbraganza |         0 |                  0 |    0 |         0 |   2018-10-12 | ---------- |
#+END:
** BURNDOWN CHART
#+BEGIN: block-update-graph
:                                                                               
:                                    Burndown                                   
:                                                                               
:  45 +---------------------------------------------------------------------+   
:     |   ########################################                          |   
:  40 |+  ....                                    ####       ACTUAL #######+|   
:     |       .                                       ########IDEAL#....... |   
:  35 |+       ........                                                  # +|   
:     |                .                                                 #  |   
:  30 |+                ....                                              #+|   
:     |                     ....                                           #|   
:  25 |+                        .....                                      #|   
:     |                              ....                                   |   
:  20 |+                                 ....                              +|   
:     |                                      .....                          |   
:  15 |+                                          ....                     +|   
:     |                                               .....                 |   
:  10 |+                                                   ....            +|   
:     |                                                        ....         |   
:   5 |+                                                           .....   +|   
:     |                                                                 ....|   
:   0 +---------------------------------------------------------------------+   
:     0        2        4       6        8        10       12      14       16  
:                                                                               
:
#+END:
** BURNDOWN LIST
#+PLOT: title:"Burndown" ind:1 deps:(3 4) set:"term dumb" set:"xtics scale 0.5" set:"ytics scale 0.5" file:"burndown.plt" set:"xrange [0:16]"
#+BEGIN: block-update-burndown
| DAY |       DATE | ACTUAL | IDEAL | TASKS COMPLETED |
|-----+------------+--------+-------+-----------------|
|   1 | 2018-09-24 |  41.32 |    39 |                 |
|   2 | 2018-09-25 |  41.32 |    36 |                 |
|   3 | 2018-09-26 |  41.32 |    34 |                 |
|   4 | 2018-09-27 |  41.32 |    31 |                 |
|   5 | 2018-09-28 |  41.32 |    28 |                 |
|   6 | 2018-09-29 |  41.32 |    26 |                 |
|   7 | 2018-09-30 |  41.32 |    23 |                 |
|   8 | 2018-10-01 |  41.32 |    21 |                 |
|   9 | 2018-10-02 |  41.32 |    18 |                 |
|  10 | 2018-10-03 |  39.67 |    15 | READ.1537984603 |
|  11 | 2018-10-04 |   37.0 |    13 | DEV.1537984318  |
|  12 | 2018-10-05 |   37.0 |    10 |                 |
|  13 | 2018-10-06 |   37.0 |     8 |                 |
|  14 | 2018-10-07 |   37.0 |     5 |                 |
|  15 | 2018-10-08 |   37.0 |     3 |                 |
|  16 | 2018-10-09 |   22.0 |     0 |                 |
#+END:
** TASK LIST
#+BEGIN: columnview :hlines 2 :maxlevel 5 :id "TASKS"
| ITEM                                       | TASKID          | OWNER       | PRIORITY | TODO | ESTIMATED |             ACTUAL |
|--------------------------------------------+-----------------+-------------+----------+------+-----------+--------------------|
| TASKS                                      |                 |             | B        |      |     41.32 | 21.400000000000002 |
|--------------------------------------------+-----------------+-------------+----------+------+-----------+--------------------|
| Learning Golang Chapter 5. Functions       | READ.1537984603 | bhavin192   | B        | DONE |      1.65 |               1.12 |
|--------------------------------------------+-----------------+-------------+----------+------+-----------+--------------------|
| Learning Golang Chapter 5 Exercises        | DEV.1537984318  | bhavin192   | B        | DONE |      2.67 |               3.67 |
|--------------------------------------------+-----------------+-------------+----------+------+-----------+--------------------|
| Learning Golang Chapter 6. Methods         | READ.1537984768 | bhavin192   | B        | DONE |         3 |               2.37 |
|--------------------------------------------+-----------------+-------------+----------+------+-----------+--------------------|
| Computer Network by Kruose & Ross - Part I |                 | homuncculus | A        | DONE |      12.0 |               4.03 |
|--------------------------------------------+-----------------+-------------+----------+------+-----------+--------------------|
| [[https://tutorial.djangogirls.org/en/][Django Girls Tutorial]]                      |                 | homuncculus | B        | DONE |      15.0 |               7.98 |
|--------------------------------------------+-----------------+-------------+----------+------+-----------+--------------------|
| Python Tutorials - Part I                  |                 | homuncculus | B        | DONE |       7.0 |               2.23 |
#+END:
* TASKS
  :PROPERTIES:
  :ID:       TASKS
  :SPRINTLENGTH: 16
  :SPRINTSTART: <2018-09-24 Mon>
  :wpd-jasonbraganza: 3
  :wpd-bhavin192: 0.5
  :wpd-homuncculus: 2
  :END:
** DONE Learning Golang Chapter 5. Functions [4/4]
   CLOSED: [2018-10-03 Wed 23:22]
   :PROPERTIES:
   :ESTIMATED: 1.65
   :ACTUAL:   1.12
   :OWNER: bhavin192
   :ID: READ.1537984603
   :TASKID: READ.1537984603
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-03 Wed 23:11]--[2018-10-03 Wed 23:22] =>  0:11
   CLOCK: [2018-10-03 Wed 22:52]--[2018-10-03 Wed 23:10] =>  0:18
   CLOCK: [2018-10-01 Mon 18:35]--[2018-10-01 Mon 19:03] =>  0:28
   CLOCK: [2018-09-28 Fri 19:32]--[2018-09-28 Fri 19:42] =>  0:10
   :END:
   - [X] 5.7 Variadic Functions (10m)
   - [X] 5.8 Deferred Function calls (50m)
   - [X] 5.9 Panic (25m)
   - [X] 5.10 Recover (15m)
** DONE Learning Golang Chapter 5 Exercises [4/4]
   CLOSED: [2018-10-04 Thu 19:26]
   :PROPERTIES:
   :ESTIMATED: 2.67
   :ACTUAL:   3.67
   :OWNER: bhavin192
   :ID: DEV.1537984318
   :TASKID: DEV.1537984318
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-04 Thu 19:12]--[2018-10-04 Thu 19:26] =>  0:14
   CLOCK: [2018-10-01 Mon 19:17]--[2018-10-01 Mon 19:30] =>  0:13
   CLOCK: [2018-09-30 Sun 20:40]--[2018-09-30 Sun 21:22] =>  0:42
   CLOCK: [2018-09-28 Fri 20:12]--[2018-09-28 Fri 20:23] =>  0:11
   CLOCK: [2018-09-28 Fri 19:48]--[2018-09-28 Fri 20:06] =>  0:18
   CLOCK: [2018-09-27 Thu 19:29]--[2018-09-27 Thu 19:45] =>  0:16
   CLOCK: [2018-09-27 Thu 19:14]--[2018-09-27 Thu 19:23] =>  0:09
   CLOCK: [2018-09-26 Wed 21:26]--[2018-09-26 Wed 21:56] =>  0:30
   CLOCK: [2018-09-26 Wed 20:20]--[2018-09-26 Wed 20:44] =>  0:24
   CLOCK: [2018-09-25 Tue 19:32]--[2018-09-25 Tue 20:15] =>  0:43
   :END:
   - [X] 5.6 Part II (60m)
   - [X] 5.7 (70m)
   - [X] 5.8 (15m)
   - [X] 5.10 (15m)
** DONE Learning Golang Chapter 6. Methods [6/6]
   CLOSED: [2018-10-11 Thu 23:27]
   :PROPERTIES:
   :ESTIMATED: 3
   :ACTUAL:   2.37
   :OWNER: bhavin192
   :ID: READ.1537984768
   :TASKID: READ.1537984768
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-09 Tue 23:10]--[2018-10-09 Tue 23:27] =>  0:17
   CLOCK: [2018-10-09 Tue 22:27]--[2018-10-09 Tue 23:00] =>  0:33
   CLOCK: [2018-10-08 Mon 22:47]--[2018-10-08 Mon 22:52] =>  0:05
   CLOCK: [2018-10-08 Mon 21:09]--[2018-10-08 Mon 21:24] =>  0:15
   CLOCK: [2018-10-08 Mon 20:54]--[2018-10-08 Mon 21:01] =>  0:07
   CLOCK: [2018-10-08 Mon 19:45]--[2018-10-08 Mon 19:54] =>  0:09
   CLOCK: [2018-10-08 Mon 19:10]--[2018-10-08 Mon 19:32] =>  0:22
   CLOCK: [2018-10-05 Fri 22:55]--[2018-10-05 Fri 23:04] =>  0:09
   CLOCK: [2018-10-05 Fri 22:29]--[2018-10-05 Fri 22:54] =>  0:25
   :END:
   - [X] 6.1 Method Declarations (30m)
   - [X] 6.2 Methods with a Pointer Receiver (50m)
   - [X] 6.3 Composing Types by Struct Embedding (30m)
   - [X] 6.4 Method Values and Expressions (20m)
   - [X] 6.5 Example: Bit Vector Type (30m)
   - [X] 6.6 Encapsulation (20m)
** DONE [#A] Computer Network by Kruose & Ross - Part I [2/2]          :read:
   CLOSED: [2018-10-12 Fri 10:16]
   :PROPERTIES:
   :ESTIMATED: 12.0
   :ACTUAL:   4.03
   :OWNER: homuncculus
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-03 Wed 19:26]--[2018-10-03 Wed 20:20] =>  0:54
   CLOCK: [2018-09-26 Wed 20:05]--[2018-09-26 Wed 20:45] =>  0:40
   CLOCK: [2018-09-26 Wed 19:05]--[2018-09-26 Wed 19:41] =>  0:36
   CLOCK: [2018-09-26 Wed 14:42]--[2018-09-26 Wed 15:00] =>  0:18
   CLOCK: [2018-09-26 Wed 13:47]--[2018-09-26 Wed 14:30] =>  0:43
   CLOCK: [2018-09-25 Tue 18:25]--[2018-09-25 Tue 18:53] =>  0:28
   CLOCK: [2018-09-25 Tue 17:40]--[2018-09-25 Tue 18:03] =>  0:23
   :END:
   - [X] Chapter 2. Application Layer
   - [X] Practice Problems
** DONE [#B] [[https://tutorial.djangogirls.org/en/][Django Girls Tutorial]] [100%]
   CLOSED: [2018-10-09 Tue 10:57]
   :PROPERTIES:
   :ESTIMATED: 15.0
   :ACTUAL:   7.98
   :OWNER: homuncculus
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-02 Tue 23:27]--[2018-10-03 Wed 00:51] =>  1:24
   CLOCK: [2018-10-02 Tue 18:32]--[2018-10-02 Tue 19:54] =>  1:22
   CLOCK: [2018-10-01 Mon 12:52]--[2018-10-01 Mon 14:03] =>  1:11
   CLOCK: [2018-09-30 Sun 23:15]--[2018-10-01 Mon 00:13] =>  0:58
   CLOCK: [2018-09-30 Sun 20:42]--[2018-09-30 Sun 21:51] =>  1:09
   CLOCK: [2018-09-26 Wed 15:49]--[2018-09-26 Wed 16:46] =>  0:57
   CLOCK: [2018-09-25 Tue 19:32]--[2018-09-25 Tue 20:03] =>  0:31
   CLOCK: [2018-09-25 Tue 19:01]--[2018-09-25 Tue 19:28] =>  0:27
   :END:
    - [X] Installation
    - [X] Setup Emacs
    - [X] [[https://tutorial.djangogirls.org/en/django_start_project/][First Django Project]]
    - [X] [[https://tutorial.djangogirls.org/en/django_models/][Django Models]]
    - [X] [[https://tutorial.djangogirls.org/en/django_admin/][Django Admin]]
    - [X] [[https://tutorial.djangogirls.org/en/deploy/][Deploy]]
** DONE Python Tutorials - Part I [2/2]                                :code:
   CLOSED: [2018-10-12 Fri 10:17]
   :PROPERTIES:
   :ESTIMATED: 7.0
   :ACTUAL:   2.23
   :OWNER: homuncculus
   :END:
   :LOGBOOK:
   CLOCK: [2018-10-03 Wed 15:43]--[2018-10-03 Wed 16:31] =>  0:48
   CLOCK: [2018-10-02 Tue 00:31]--[2018-10-02 Tue 00:59] =>  0:28
   CLOCK: [2018-10-01 Mon 23:26]--[2018-10-02 Tue 00:14] =>  0:48
   CLOCK: [2018-10-01 Mon 23:12]--[2018-10-01 Mon 23:16] =>  0:04
   CLOCK: [2018-10-01 Mon 22:49]--[2018-10-01 Mon 22:54] =>  0:05
   CLOCK: [2018-09-25 Tue 18:59]--[2018-09-25 Tue 19:00] =>  0:01
   :END:
   - [X] [[https://docs.python.org/3/tutorial/errors.html][Errors & Exceptions]]
   - [X] [[https://docs.python.org/3/tutorial/classes.html][Classes]]
